In [7]:
import seaborn as sns

titanic_data = sns.load_dataset("titanic")

titanic_data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

VD 4.9.1.2

In [8]:
print(titanic_data.isna().sum())

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

VD 4.9.1.3

In [9]:
print('Số hàng ban đầu của CSDL:',len(titanic_data)) 

#Xóa cột 'desk'
titanic_data.drop(labels='deck', axis=1, inplace=True) 

#Xóa toàn bộ các hàng có chứa giá trị 'NA'
titanic_data.dropna(how='any',axis=0, inplace=True) 
print('Số hàng còn lại trong CSDL:', len(titanic_data))

Số hàng ban đầu của CSDL: 891
Số hàng còn lại trong CSDL: 712

VD 4.9.1.4

In [10]:
#Thống kê tuổi trung bình của hành khách đi tầu Titanic theo khoang:
print('Tuổi trung bình của hành khách trên tầu theo khoang: \n',  
      titanic_data.groupby(['class'])[['age']].mean())

Tuổi trung bình của hành khách trên tầu theo khoang:
               age
class
First   38.105543
Second  29.877630
Third   25.140620

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_1444\497259363.py:3: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic_data.groupby(['class'])[['age']].mean())

VD 4.9.1.5

In [11]:
avg_age_by_class_gt=titanic_data.groupby(['sex','class']) [['age']].mean()
print("Độ tuổi trung bình theo giới tính ở các khoang là: \n",  
      avg_age_by_class_gt)

Độ tuổi trung bình theo giới tính ở các khoang là:
                      age
sex    class
female First   34.240964
       Second  28.722973
       Third   21.750000
male   First   41.281386
       Second  30.740707
       Third   26.507589

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_1444\2870891108.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  avg_age_by_class_gt=titanic_data.groupby(['sex','class']) [['age']].mean()

VD 4.9.1.6

In [12]:
avg_age_by_class_gt.unstack()

              age
class       First     Second      Third
sex
female  34.240964  28.722973  21.750000
male    41.281386  30.740707  26.507589

VD 4.9.1.7

In [13]:
#Sử dụng Piovot tables:
titanic_data.pivot_table('age',index='sex',columns='class')

class       First     Second      Third
sex
female  34.240964  28.722973  21.750000
male    41.281386  30.740707  26.507589

VD 4.9.2

VD 4.9.2.1

In [14]:
titanic_data.pivot_table('survived',index='sex',columns='class')

class      First    Second     Third
sex
female  0.963855  0.918919  0.460784
male    0.396040  0.151515  0.150198

4.9.2.2

In [15]:
titanic_data.pivot_table('survived',index='sex',columns= 'class',margins=True)

class      First    Second     Third       All
sex
female  0.963855  0.918919  0.460784  0.752896
male    0.396040  0.151515  0.150198  0.205298
All     0.652174  0.479769  0.239437  0.404494

4.9.2.3

In [16]:
titanic_data.pivot_table(['fare','survived'],index='sex',  
                         columns='class',aggfunc={'fare':'sum','survived':'mean'},  
                         margins=True)

              fare                                    survived            \
class        First     Second      Third         All     First    Second
sex
female   9015.4334  1624.3792  1619.2876  12259.1002  0.963855  0.918919
male     7185.4209  2090.2000  3077.1619  12352.7828  0.396040  0.151515
All     16200.8543  3714.5792  4696.4495  24611.8830  0.652174  0.479769


class      Third       All
sex
female  0.460784  0.752896
male    0.150198  0.205298
All     0.239437  0.404494

4.9.2.4

In [24]:
titanic_data.pivot_table(['fare'],index='sex', columns='class',aggfunc='count', margins=True)

        fare
class  First Second Third  All
sex
female    83     74   102  259
male     101     99   253  453
All      184    173   355  712

4.9.2.5

In [17]:
#Thống kê số lượng hành khách trên từng khoang:
titanic_data.pivot_table(['fare'],index='sex', columns='class', margins=True)

              fare
class        First     Second      Third        All
sex
female  108.619680  21.951070  15.875369  47.332433
male     71.142781  21.113131  12.162695  27.268836
All      88.048121  21.471556  13.229435  34.567251

4.9.2.6

In [20]:
import pandas as pd
age=pd.cut(titanic_data['age'],[0,18,80])
age

0      (18, 80]
1      (18, 80]
2      (18, 80]
3      (18, 80]
4      (18, 80]
         ...
885    (18, 80]
886    (18, 80]
887    (18, 80]
889    (18, 80]
890    (18, 80]
Name: age, Length: 712, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 80]]

In [21]:
print("Mô tả về độ tuổi: \n",age.describe())

Mô tả về độ tuổi:
 count          712
unique           2
top       (18, 80]
freq           573
Name: age, dtype: object

4.9.2.7

In [22]:
print("Thống kê về độ tuổi, loại khoang với tỷ lệ sống sót: \n",  
      titanic_data.pivot_table('survived',['sex',age],'class'))

Thống kê về độ tuổi, loại khoang với tỷ lệ sống sót:
 class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972222  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

4.9.2.8

In [23]:
age=pd.cut(titanic_data['age'],[0,18,80])
fare=pd.qcut(titanic_data['fare'], 2)
titanic_data.pivot_table('survived',['sex',age],[fare,'class'])

fare            (-0.001, 15.646]                     (15.646, 512.329]  \
class                      First    Second     Third             First
sex    age
female (0, 18]               NaN  1.000000  0.652174          0.909091
       (18, 80]              NaN  0.884615  0.435897          0.972222
male   (0, 18]               NaN  0.200000  0.260870          0.800000
       (18, 80]              0.0  0.094340  0.122222          0.391304

fare
class              Second     Third
sex    age
female (0, 18]   1.000000  0.350000
       (18, 80]  0.911765  0.400000
male   (0, 18]   0.800000  0.178571
       (18, 80]  0.032258  0.227273